Repository: EagleForce14/Batch-Renaming
Catalog: BulkRenamer/Strings/*/Resources.resw
Source language: en_us
Languages: fr_fr

# AppBarAdd.Label
source: Add files
fr_fr: Ajouter des fichiers

# AppBarFolder.Label
source: Add folder
fr_fr: Ajouter un dossier

# AppBarRemove.Label
source: Remove selected
fr_fr: Retirer sélection

# AppBarClear.Label
source: Clear
fr_fr: Vider

# AppBarUndo.Label
source: Reset
fr_fr: Annuler

# ApplyButtonText.Text
source: Apply
fr_fr: Appliquer

# ScopeLabel.Text
source: Scope
fr_fr: Portée

# ScopeNameItem.Content
source: File name only
fr_fr: Nom du fichier uniquement

# ScopeExtensionItem.Content
source: Extension only
fr_fr: Extension uniquement

# ScopeFullItem.Content
source: File name and extension
fr_fr: Nom du fichier et extension

# PrefixLabel.Text
source: Prefix
fr_fr: Préfixe

# PrefixBox.PlaceholderText
source: e.g. final_
fr_fr: ex: final_

# SuffixLabel.Text
source: Suffix
fr_fr: Suffixe

# SuffixBox.PlaceholderText
source: e.g. _v2
fr_fr: ex: _v2

# SearchLabel.Text
source: Find
fr_fr: Rechercher

# SearchBox.PlaceholderText
source: e.g. draft
fr_fr: ex: brouillon

# ReplaceLabel.Text
source: Replace with
fr_fr: Remplacer par

# ReplaceBox.PlaceholderText
source: e.g. final
fr_fr: ex: final

# RegexToggle.Content
source: Regular expression
fr_fr: Expression régulière

# RegexAllToggle.Content
source: Replace all occurrences
fr_fr: Remplacer toutes les occurrences

# InsertLabel.Text
source: Insert
fr_fr: Insérer

# InsertAfterLabel.Text
source: After character
fr_fr: Après le caractère

# InsertTextBox.PlaceholderText
source: e.g. _v2
fr_fr: ex: _v2

# CaseLabel.Text
source: Case
fr_fr: Casse

# CaseNoneItem.Content
source: None
fr_fr: Aucune

# CaseLowerItem.Content
source: Lowercase
fr_fr: Minuscules

# CaseUpperItem.Content
source: Uppercase
fr_fr: Majuscules

# CaseTitleItem.Content
source: Title Case
fr_fr: Capitaliser

# RemoveAccentsToggle.Content
source: Remove accents
fr_fr: Supprimer les accents

# NumberingExpander.Header
source: Numbering
fr_fr: Numérotation

# NumberingToggle.Content
source: Enable
fr_fr: Activer

# NumberStartLabel.Text
source: Start
fr_fr: Départ

# NumberPaddingLabel.Text
source: Padding
fr_fr: Zéros

# NumberSeparatorLabel.Text
source: Separator
fr_fr: Séparateur

# NumberSeparatorBox.PlaceholderText
source: e.g. _
fr_fr: ex: _

# DirectoryHeader.Text
source: Folder
fr_fr: Dossier

# EmptyStateText.Text
source: Drag and drop files here or use Add
fr_fr: Glissez-déposez des fichiers ici ou utilisez Ajouter

# ClearDialogTitle
source: Clear the list?
fr_fr: Vider la liste ?

# ClearDialogContent
source: Changes to file titles will be lost.
fr_fr: Les modifications apportées aux titres des fichiers seront perdues.

# ClearDialogPrimary
source: Clear
fr_fr: Vider

# ClearDialogClose
source: Cancel
fr_fr: Annuler

# ApplyNoFilesMessage
source: Import files before applying.
fr_fr: Importez des fichiers avant d'appliquer.

# ErrorMessage
source: Error: {0}
fr_fr: Erreur : {0}

# ApplySuccessMessage
source: {0} rename(s) applied, {1} skipped.
fr_fr: {0} renommage(s) appliqué(s), {1} ignoré(s).

# ApplyNoneMessage
source: No rename applied.
fr_fr: Aucun renommage appliqué.

# AddFilesMessage
source: Files added ({0})
fr_fr: Fichiers ajoutés ({0})

# ConfirmSubfoldersTitle
source: Include subfolders?
fr_fr: Inclure les sous-dossiers ?

# ConfirmSubfoldersContent
source: Folder '{0}' contains subfolders. Add them?
fr_fr: Le dossier '{0}' contient des sous-dossiers. Les ajouter ?

# ConfirmSubfoldersYes
source: Yes
fr_fr: Oui

# ConfirmSubfoldersNo
source: No
fr_fr: Non

# NomHeaderText
source: Original name ({0})
fr_fr: Nom original ({0})

# ApercuHeaderText
source: Renamed ({0})
fr_fr: Renommé ({0})

# ConflictErrorMessage
source: Name conflict: The files {0} would all be renamed to '{1}'.
fr_fr: Conflit de noms : les fichiers {0} auraient tous le nom '{1}'.

# FilterAll.Content
source: All files
fr_fr: Tous les fichiers

# FilterEnabledOnly.Content
source: Enabled files only
fr_fr: Fichiers activés uniquement

# FilterDisabledOnly.Content
source: Disabled files only
fr_fr: Fichiers désactivés uniquement

# FilterWithChanges.Content
source: Files with changes
fr_fr: Fichiers avec changements

# FilterWithoutChanges.Content
source: Files without changes
fr_fr: Fichiers sans changements

# AppBarSaveConfig.Label
source: Save rules
fr_fr: Sauvegarder les règles

# AppBarLoadConfig.Label
source: Load rules
fr_fr: Charger des règles

# SaveConfigSuccessMessage
source: Configuration saved successfully
fr_fr: Configuration sauvegardée avec succès

# LoadConfigSuccessMessage
source: Configuration loaded successfully
fr_fr: Configuration chargée avec succès

# LoadConfigErrorMessage
source: Error loading configuration: {0}
fr_fr: Erreur lors du chargement de la configuration : {0}

# MenuRemoveSelected.Text
source: Remove selected
fr_fr: Retirer la sélection

# RemoveCharsExpander.Header
source: Remove characters
fr_fr: Suppression de caractères

# RemoveFirstToggle.Content
source: Remove first
fr_fr: Supprimer les premiers

# RemoveLastToggle.Content
source: Remove last
fr_fr: Supprimer les derniers
